backend/app/controllers/destinations_controller.rb

SELECT "destinations".* FROM "destinations"
---
    def index
        @destinations = Destination.all

INSERT INTO "destinations" ("city", "country", "date", "activities", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["city", ";lk"], ["country", ";lk"], ["date", "';kl"], ["activities", ";lk"], ["created_at", "2021-04-13 15:24:35.872866"], ["updated_at", "2021-04-13 15:24:35.872866"]]
---
    def create

        @destination = Destination.create(
            city: to_params[:city],
            country: to_params[:country],
            date: to_params[:date],
            activities: to_params[:activities]
          )

SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
DELETE FROM "destinations" WHERE "destinations"."id" = ?  [["id", 19]]
---
    def destroy
        @destination = Destination.find_by_id(params[:id])
        @destination.destroy